app/controllers/movies_controller.rb

  def create
    @movie = current_user.movies.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "hotness", "image_url", "synopsis", "rating", "genre", "director", "runtime", "release_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]